const dummyQuestions = JSON.parse(`[
    {
        "_id": "6782baa634f41fcdedf308b6",
        "question": "Поправи 14 грешки в текста - правописни, пунктуационни и при членуване",
        "type": "editing",
        "options": [],
        "text": "Конструктора Асен Йорданов, изубретява въздушната вазглавница но не я патентова. Устройството, свързано със безопастността на пътниците в самолета цели претпазването им при аварийно кацане. По*късно изобретението е ваведено в автомобилното производство. Йорданов създава и телефонният секретар, даващ възможнос за разговор на няколко души едновремено.",
        "answer": "Конструкторът Асен Йорданов изобретява въздушната възглавница, но не я патентова. Устройството, свързано с безопасността на пътниците в самолета, цели предпазването им при аварийно кацане. По-късно изобретението е въведено в автомобилното производство. Йорданов създава и телефонния секретар, даващ възможност за разговор на няколко души едновременно.",
        "topic": "Редактиране на текст",
        "createdAt": {
            "$date": "2025-01-11T18:37:41.811Z"
        },
        "__v": 0,
        "mistakesCnt": 14
    },
    {
        "_id": "6785685bb0b0c5461de8a8f1",
        "question": "В кой ред думите са синоними?",
        "type": "options",
        "options": ["право, отказ", "паспорт, заявление", "договор, споразумение", "пребиваване, управление"],
        "answer": "договор, споразумение",
        "topic": "Връзки между думи",
        "createdAt": {
            "$date": "2025-01-13T19:23:13.978Z"
        },
        "__v": 0
    },
    {
        "_id": "678568f3b0b0c5461de8a8f4",
        "question": "Какво е по състав изречението?\\nПо своите базови характеристики новите лични документи няма да се различават от съществуващите до момента.",
        "type": "options",
        "options": ["сложно смесено", "сложно съставно", "сложно съчинено", "просто изречение"],
        "answer": "просто изречение",
        "topic": "Сложно изречение",
        "createdAt": {
            "$date": "2025-01-13T19:23:13.978Z"
        },
        "__v": 0
    },
    {
        "_id": "67856977b0b0c5461de8a8f7", 
        "question": "Запишете сказуемото в главното изречение: Писменото искане за издаване на лична карта непълнолетните (от 14 г. до 18 г.) трябва да подадат лично и в присъствието на родител, настойник или попечител, който полага подпис в заявлението.",
        "type": "shortAnswer",
        "options": [],
        "answer": "трябва да подадат",
        "topic": "Съставно сказуемо",
        "createdAt": {
            "$date": "2025-01-13T19:23:13.978Z"
        },
        "__v": 0
    }
]`);


export function getQuestions() {
    return dummyQuestions;
}