const belTopics = [
    "Наклонение на глагола",
    "Думи като части на речта",
    "Думи като части на изречението",
    "Местоимения",
    "Видове сказуеми",
    "Обособени части",
    "Сложно изречение",
    "Причастия",
    "Преобразуване на част от изречението",
];

const lit5Topics = ["Хайдути"];
const lit6Topics = [
    "Хубава си, моя горо",
    "Отечество любезно, как хубаво си ти!",
    "Косачи",
    "Художник",
    "Представлението, Под игото",
    "Радини вълнения, Под игото",
    "Братчетата на Гаврош",
    "Серафим"
];

const lit7Topics = [
    "Стани, стани, юнак балкански",
    "Вятър ечи, Балкан стене",
    "На прощаване в 1868г",
    "Немили-недраги",
    "Една българка",
    "Опълченците на Шипка",
    "Българският език",
    "До Чикаго и назад",
    "Бай Ганьо",
    "Неразделни",
    "Заточеници",
    "По жътва",
    "По жицата"
];

const litTopics = [...lit5Topics, ...lit6Topics, ...lit7Topics];

export { lit5Topics, lit6Topics, lit7Topics, belTopics, litTopics };